# Series and Dataframes

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
x = Series([30, 40, 50])

In [3]:
x

0    30
1    40
2    50
dtype: int64

In [4]:
x.values

array([30, 40, 50], dtype=int64)

In [5]:
x.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
# Create Series with Index

In [7]:
Sales = Series([450000, 650000, 870000, 900000], index=["Q1", "Q2", "Q3", "Q4"])
Sales

Q1    450000
Q2    650000
Q3    870000
Q4    900000
dtype: int64

In [8]:
Sales["Q2"]

650000

In [9]:
Sales[Sales > 500000]

Q2    650000
Q3    870000
Q4    900000
dtype: int64

In [10]:
"Q1" in Sales

True

In [11]:
"John" in Sales

False

In [12]:
450000 in Sales

False

In [13]:
1 in x

True

In [14]:
# Converting Series to Dictionaries

In [15]:
Sales_dict = Sales.to_dict()

In [16]:
Sales_dict

{'Q1': 450000, 'Q2': 650000, 'Q3': 870000, 'Q4': 900000}

In [17]:
# Converting Dictionaries to Series

In [18]:
Sales_series = Series(Sales_dict)
Sales_series

Q1    450000
Q2    650000
Q3    870000
Q4    900000
dtype: int64

In [19]:
# Adding extra indices to Series from a dictionary

In [20]:
Sales_dict

{'Q1': 450000, 'Q2': 650000, 'Q3': 870000, 'Q4': 900000}

In [21]:
New = ["Q1", "Q2", "Q3", "Q4", "Q5"]

In [22]:
SSales = Series(Sales_dict, index= New)

In [23]:
SSales

Q1    450000.0
Q2    650000.0
Q3    870000.0
Q4    900000.0
Q5         NaN
dtype: float64

In [24]:
# Finding Null values

In [25]:
pd.isnull(SSales)

Q1    False
Q2    False
Q3    False
Q4    False
Q5     True
dtype: bool

In [26]:
# Adding values in Series

In [27]:
Sales + SSales

Q1     900000.0
Q2    1300000.0
Q3    1740000.0
Q4    1800000.0
Q5          NaN
dtype: float64

In [28]:
# Naming a Series

In [29]:
SSales.name = "Total Sales"

In [30]:
SSales

Q1    450000.0
Q2    650000.0
Q3    870000.0
Q4    900000.0
Q5         NaN
Name: Total Sales, dtype: float64

In [31]:
# Naming an index

In [32]:
SSales.index.name = "Quarter"

In [33]:
SSales

Quarter
Q1    450000.0
Q2    650000.0
Q3    870000.0
Q4    900000.0
Q5         NaN
Name: Total Sales, dtype: float64

# Creating a DataFrame

In [34]:
data = [["Adrian", 20], ["Beatrice", 32], ["Chloe", 41]]
df = pd.DataFrame(data, columns= ["Name", "Age"], dtype= int)
df

       Name  Age
0    Adrian   20
1  Beatrice   32
2     Chloe   41

In [35]:
# Creating a DataFrame from Dictionaries

In [36]:
new = {"Name":["Tom", "Jack", "Steve", "Ricky"], "Sales":[25000, 30000, 40000, 42000]}
df = pd.DataFrame(new)
df

    Name  Sales
0    Tom  25000
1   Jack  30000
2  Steve  40000
3  Ricky  42000

In [37]:
df = pd.DataFrame(new, index=["rank1", "rank2", "rank3", "rank4"])
df

        Name  Sales
rank1    Tom  25000
rank2   Jack  30000
rank3  Steve  40000
rank4  Ricky  42000

In [38]:
data = [{"a": 1, "b": 2}, {"a":5, "b": 10, "c": 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [39]:
data = [{"East":15000, "West": 20000}, {"East":5000, "West":10500, "South":20000}]
# with two column indicies, values same as dictionary keys
df1 = pd.DataFrame(data, index=["Sales1", "Sales2"], columns=["East", "West"])
# with two column indicies, with one index with other name
df2 = pd.DataFrame(data, index=["Sales1", "Sales2"], columns=["East", "South"])

In [40]:
df1

         East   West
Sales1  15000  20000
Sales2   5000  10500

In [41]:
df2

         East    South
Sales1  15000      NaN
Sales2   5000  20000.0

In [42]:
# Create a DataFrame from Dictionary of Series

In [43]:
Sales = {"East": pd.Series([10000, 20000, 30000], index=["Q1", "Q2", "Q3"]),
        "West": pd.Series([15000, 25000, 35000, 45000], index=["Q1", "Q2", "Q3", "Q4"])}

Sales_df = pd.DataFrame(Sales)
Sales_df

       East   West
Q1  10000.0  15000
Q2  20000.0  25000
Q3  30000.0  35000
Q4      NaN  45000

In [44]:
# Adding columns to the DataFrame

In [45]:
Sales_df["South"] = pd.Series([17000, 27000, 37000], index=["Q1", "Q2", "Q4"])

In [46]:
Sales_df

       East   West    South
Q1  10000.0  15000  17000.0
Q2  20000.0  25000  27000.0
Q3  30000.0  35000      NaN
Q4      NaN  45000  37000.0

In [47]:
# Adding values in the DataFrame

In [48]:
Sales_df["North"] = Sales_df["East"] + Sales_df["South"]
Sales_df

       East   West    South    North
Q1  10000.0  15000  17000.0  27000.0
Q2  20000.0  25000  27000.0  47000.0
Q3  30000.0  35000      NaN      NaN
Q4      NaN  45000  37000.0      NaN

In [49]:
Sales_df["South East"] = Sales_df["South"]- Sales_df["East"]
Sales_df

       East   West    South    North  South East
Q1  10000.0  15000  17000.0  27000.0      7000.0
Q2  20000.0  25000  27000.0  47000.0      7000.0
Q3  30000.0  35000      NaN      NaN         NaN
Q4      NaN  45000  37000.0      NaN         NaN

# Index and reindex objects

In [50]:
Sales = Series([450000, 650000, 870000], index=["Don", "Mike", "Edwin"])
Sales

Don      450000
Mike     650000
Edwin    870000
dtype: int64

In [51]:
SalesReindexed = Sales.reindex(["Mike", "Edwin", "Jack"])
SalesReindexed

Mike     650000.0
Edwin    870000.0
Jack          NaN
dtype: float64

In [52]:
SalesReindexed = Sales.reindex(["Mike", "Edwin", "Jack"], fill_value=0)
SalesReindexed

Mike     650000
Edwin    870000
Jack          0
dtype: int64

In [53]:
# Indexing and reindexing in DataFrame

In [54]:
data = {"county":["Croydon", "Cornwall", "Cumbria", "Durham", "Hampshire"],
       "year": [2012, 2012, 2013, 2014, 2014],
       "sales":[45000, 24000, 31000, 20000, 30000]}
Sales_df = pd.DataFrame(data)
Sales_df

      county  year  sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [55]:
# Changing the order of the rows

In [56]:
Sales_df.reindex([4,3,2,1,0])

      county  year  sales
4  Hampshire  2014  30000
3     Durham  2014  20000
2    Cumbria  2013  31000
1   Cornwall  2012  24000
0    Croydon  2012  45000

In [57]:
# Change the order of the columns

In [58]:
columnsTitles = ["year", "county", "sales"]
Sales_df.reindex(columns=columnsTitles)

   year     county  sales
0  2012    Croydon  45000
1  2012   Cornwall  24000
2  2013    Cumbria  31000
3  2014     Durham  20000
4  2014  Hampshire  30000

In [59]:
# Dropping index in Series

In [60]:
ser1 = Series(np.arange(3), index=["AA", "BB", "CC"])
ser1

AA    0
BB    1
CC    2
dtype: int32

In [61]:
ser1.drop("CC")

AA    0
BB    1
dtype: int32

In [62]:
ser2 = ser1.drop("CC")

In [63]:
ser2

AA    0
BB    1
dtype: int32

In [64]:
ser1

AA    0
BB    1
CC    2
dtype: int32

In [65]:
# Dropping index in DataFrame

In [66]:
Sales_df = DataFrame(np.arange(9).reshape(3,3), index= ["SF", "NYC", "BO"],
                    columns=["country", "Region", "Sale"])
Sales_df

     country  Region  Sale
SF         0       1     2
NYC        3       4     5
BO         6       7     8

In [67]:
Sales_df.drop("SF")

     country  Region  Sale
NYC        3       4     5
BO         6       7     8

# Selecting entries

In [68]:
# Selecting entries in Series

In [69]:
ser1

AA    0
BB    1
CC    2
dtype: int32

In [70]:
ser1 = 2*ser1
ser1

AA    0
BB    2
CC    4
dtype: int32

In [71]:
ser1["BB"]

2

In [72]:
ser1[1]

2

In [73]:
ser1[0:3]

AA    0
BB    2
CC    4
dtype: int32

In [74]:
ser1[["AA", "BB"]]

AA    0
BB    2
dtype: int32

In [75]:
ser1[ser1>2]

CC    4
dtype: int32

In [76]:
ser1[ser1>2]=20

In [77]:
ser1

AA     0
BB     2
CC    20
dtype: int32

In [78]:
# Selecting entries in DataFrame

In [79]:
data = {"county":["Croydon", "Cornwall", "Cumbria", "Durham", "Hampshire"],
       "year": [2012, 2012, 2013, 2014, 2014],
       "sales":[45000, 24000, 31000, 20000, 30000]}
Sales_df = pd.DataFrame(data)
Sales_df

      county  year  sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [80]:
Sales_df["year"]

0    2012
1    2012
2    2013
3    2014
4    2014
Name: year, dtype: int64

In [81]:
Sales_df[["year", "sales"]]

   year  sales
0  2012  45000
1  2012  24000
2  2013  31000
3  2014  20000
4  2014  30000

In [82]:
Sales_df

      county  year  sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [83]:
# Sales_df > 25000

In [84]:
Sales_df["sales"] > 25000

0     True
1    False
2     True
3    False
4     True
Name: sales, dtype: bool

In [85]:
Sales_df.iloc[2]

county    Cumbria
year         2013
sales       31000
Name: 2, dtype: object

In [86]:
Sales_df.iloc[4]

county    Hampshire
year           2014
sales         30000
Name: 4, dtype: object

# Data Alignment

In [87]:
# Data alignment in series

In [88]:
Sales = Series([15000, 25000, 34000], index=["East", "West", "South"])
Sales

East     15000
West     25000
South    34000
dtype: int64

In [89]:
Sales1 = Series([10000, 20000, 30000, 40000], index=["East", "West", "South", "North"])
Sales1

East     10000
West     20000
South    30000
North    40000
dtype: int64

In [90]:
Sales + Sales1

East     25000.0
North        NaN
South    64000.0
West     45000.0
dtype: float64

In [91]:
Sales.add(Sales1, fill_value=0)

East     25000.0
North    40000.0
South    64000.0
West     45000.0
dtype: float64

In [92]:
# data alignment in dataframes

In [93]:
data = {"county":["Croydon", "Cornwall", "Cumbria", "Durham", "Hampshire"],
       "year": [2012, 2012, 2013, 2014, 2014],
       "sales":[45000, 24000, 31000, 20000, 30000]}
Sales_df = pd.DataFrame(data)
Sales_df

      county  year  sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [94]:
data = {"county":["Croydon", "Cornwall", "Cumbria"],
       "year": [2012, 2012, 2013],
       "sales":[45000, 24000, 31000]}
Sales1_df = DataFrame(data)
Sales1_df

     county  year  sales
0   Croydon  2012  45000
1  Cornwall  2012  24000
2   Cumbria  2013  31000

In [95]:
Sales_df["sales"] +Sales1_df["sales"]

0    90000.0
1    48000.0
2    62000.0
3        NaN
4        NaN
Name: sales, dtype: float64

In [96]:
Sales_df["sales"].add(Sales1_df["sales"], fill_value=0)

0    90000.0
1    48000.0
2    62000.0
3    20000.0
4    30000.0
Name: sales, dtype: float64

# Sorting and Ranking

In [97]:
# Sorting in series

In [98]:
Sales1 = Series(["10000", "20000", "30000", "40000"], index=["East", "West", "South", "North"])
Sales1

East     10000
West     20000
South    30000
North    40000
dtype: object

In [99]:
Sales1.sort_index()

East     10000
North    40000
South    30000
West     20000
dtype: object

In [100]:
Sales1.sort_index(ascending=1)

East     10000
North    40000
South    30000
West     20000
dtype: object

In [101]:
Sales1.sort_index(ascending=0)

West     20000
South    30000
North    40000
East     10000
dtype: object

In [102]:
Sales1.sort_values()

East     10000
West     20000
South    30000
North    40000
dtype: object

In [103]:
Sales1.sort_values(ascending = False)

North    40000
South    30000
West     20000
East     10000
dtype: object

In [104]:
# ranking

In [105]:
Sales1.rank(ascending=0)

East     4.0
West     3.0
South    2.0
North    1.0
dtype: float64

In [106]:
Sales1.rank(ascending=1)

East     1.0
West     2.0
South    3.0
North    4.0
dtype: float64

In [107]:
# sorting and ranking in DataFrames

In [108]:
data = {"county":["Croydon", "Cornwall", "Cumbria", "Durham", "Hampshire"],
       "year": [2012, 2012, 2013, 2014, 2014],
       "sales":[45000, 24000, 31000, 20000, 30000]}
Sales_df = pd.DataFrame(data)
Sales_df

      county  year  sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [109]:
Sales_df.sort_index(ascending=1)

      county  year  sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

In [110]:
Sales_df.sort_index(ascending=0)

      county  year  sales
4  Hampshire  2014  30000
3     Durham  2014  20000
2    Cumbria  2013  31000
1   Cornwall  2012  24000
0    Croydon  2012  45000

In [111]:
Sales_df["Salesranked"] = Sales_df["sales"].rank(ascending = 0)
Sales_df

      county  year  sales  Salesranked
0    Croydon  2012  45000          1.0
1   Cornwall  2012  24000          4.0
2    Cumbria  2013  31000          2.0
3     Durham  2014  20000          5.0
4  Hampshire  2014  30000          3.0

In [112]:
Sales_df.sort_values(by=["sales"], ascending= False)

      county  year  sales  Salesranked
0    Croydon  2012  45000          1.0
2    Cumbria  2013  31000          2.0
4  Hampshire  2014  30000          3.0
1   Cornwall  2012  24000          4.0
3     Durham  2014  20000          5.0

In [113]:
Sales_df.sort_values(by=["sales"], ascending = False)[:3]

      county  year  sales  Salesranked
0    Croydon  2012  45000          1.0
2    Cumbria  2013  31000          2.0
4  Hampshire  2014  30000          3.0

In [114]:
Sales_df["sales"].rank()

0    5.0
1    2.0
2    4.0
3    1.0
4    3.0
Name: sales, dtype: float64

In [115]:
Sales_df[["sales", "Salesranked"]] # exercise

   sales  Salesranked
0  45000          1.0
1  24000          4.0
2  31000          2.0
3  20000          5.0
4  30000          3.0

# Summary Statistics

In [116]:
arr = np.array([[1, 2, np.NaN], [np.NaN, 3, 4]])

In [117]:
dframe = DataFrame(arr, index=["A", "B"], columns=["One", "Two", "Three"])

In [118]:
dframe

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [119]:
# adding along columns

In [120]:
dframe.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [121]:
# adding along the rows

In [122]:
dframe.sum(axis=1)

A    3.0
B    7.0
dtype: float64

In [123]:
# finding the minimum value in each column

In [124]:
dframe.min()

One      1.0
Two      2.0
Three    4.0
dtype: float64

In [125]:
# finding the index of the values across columns

In [126]:
dframe.idxmin()

One      A
Two      A
Three    B
dtype: object

In [127]:
# cumulative sum

In [128]:
dframe.cumsum()

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [129]:
dframe.cumsum(axis=1)

   One  Two  Three
A  1.0  3.0    NaN
B  NaN  3.0    7.0

In [130]:
# summary statistics

In [131]:
dframe.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [132]:
# Finding unique values in series

In [133]:
Sales = Series([25000, 30000, 45000, 25000, 30000, 45000])

In [134]:
Sales

0    25000
1    30000
2    45000
3    25000
4    30000
5    45000
dtype: int64

In [135]:
Sales.unique()

array([25000, 30000, 45000], dtype=int64)

In [136]:
# counting the number of value occurences

In [137]:
Sales

0    25000
1    30000
2    45000
3    25000
4    30000
5    45000
dtype: int64

In [138]:
Sales.value_counts()

30000    2
45000    2
25000    2
dtype: int64

In [139]:
Sales.value_counts()[25000]

2

# Missing Data

In [140]:
# checking for null values

In [141]:
data = Series(["One", "Two", np.nan, "Four"])
data

0     One
1     Two
2     NaN
3    Four
dtype: object

In [142]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [143]:
sum(data.isnull())

1

In [144]:
# dropping the null value

In [145]:
data.dropna()

0     One
1     Two
3    Four
dtype: object

In [146]:
# deleting null values from the dataframe

In [147]:
dframe = DataFrame([[1,2,3], [1, np.nan, 3], [1,2, np.nan], [2, np.nan, np.nan]], columns=["a", "b", "c"])
dframe

   a    b    c
0  1  2.0  3.0
1  1  NaN  3.0
2  1  2.0  NaN
3  2  NaN  NaN

In [148]:
clean_dframe = dframe.dropna()

In [149]:
clean_dframe

   a    b    c
0  1  2.0  3.0

In [150]:
dframe.dropna(axis=1)

   a
0  1
1  1
2  1
3  2

In [151]:
dframe.dropna(how="all")

   a    b    c
0  1  2.0  3.0
1  1  NaN  3.0
2  1  2.0  NaN
3  2  NaN  NaN

In [152]:
dframe.dropna(thresh=1)

   a    b    c
0  1  2.0  3.0
1  1  NaN  3.0
2  1  2.0  NaN
3  2  NaN  NaN

In [153]:
dframe.dropna(thresh=2)

   a    b    c
0  1  2.0  3.0
1  1  NaN  3.0
2  1  2.0  NaN

In [154]:
# filling the null values with values

In [155]:
dframe

   a    b    c
0  1  2.0  3.0
1  1  NaN  3.0
2  1  2.0  NaN
3  2  NaN  NaN

In [156]:
dframe.fillna(1)

   a    b    c
0  1  2.0  3.0
1  1  1.0  3.0
2  1  2.0  1.0
3  2  1.0  1.0

In [157]:
dframe.fillna({"a":10, "b":20, "c":30})

   a     b     c
0  1   2.0   3.0
1  1  20.0   3.0
2  1   2.0  30.0
3  2  20.0  30.0

In [158]:
dframe.fillna(0,inplace=True)

In [159]:
dframe

   a    b    c
0  1  2.0  3.0
1  1  0.0  3.0
2  1  2.0  0.0
3  2  0.0  0.0

# Index Hierachy

In [160]:
# create series from random numbers

In [161]:
from numpy.random import random

In [162]:
ser = Series(random(6), index=[[1,1,1,2,2,2], ["a", "b", "c", "a", "b", "c"]])

In [163]:
ser

1  a    0.613188
   b    0.023591
   c    0.287021
2  a    0.478960
   b    0.394859
   c    0.874007
dtype: float64

In [164]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [165]:
ser[1]

a    0.613188
b    0.023591
c    0.287021
dtype: float64

In [166]:
ser[2]

a    0.478960
b    0.394859
c    0.874007
dtype: float64

In [167]:
ser[:,"a"]

1    0.613188
2    0.478960
dtype: float64

In [168]:
ser[:,"c"]

1    0.287021
2    0.874007
dtype: float64

In [169]:
dframe = ser.unstack()
dframe

          a         b         c
1  0.613188  0.023591  0.287021
2  0.478960  0.394859  0.874007

In [170]:
# applying multiple index names on dataframe

In [171]:
dframe2 = DataFrame(np.arange(16).reshape(4,4), index=[["a", "a", "b", "b"], [1,2,1,2]],
                   columns= [["NY", "NY", "LA", "SFO"], ["Cold", "Hot", "Hot", "Cold"]])
dframe2

      NY      LA  SFO
    Cold Hot Hot Cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [172]:
dframe2.index.names=["INDEX_1", "INDEX_2"]
dframe2.columns.names=["Cities", "Temp"]
dframe2

Cities            NY      LA  SFO
Temp            Cold Hot Hot Cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [173]:
# changing the level of index

In [174]:
dframe2.swaplevel("Cities", "Temp", axis=1)

Temp            Cold Hot     Cold
Cities            NY  NY  LA  SFO
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [175]:
# sorting on the index level

In [176]:
dframe2.sort_index(level=1)

Cities            NY      LA  SFO
Temp            Cold Hot Hot Cold
INDEX_1 INDEX_2
a       1          0   1   2    3
b       1          8   9  10   11
a       2          4   5   6    7
b       2         12  13  14   15

In [177]:
# adding the values

In [178]:
dframe2.sum(level="Temp", axis=1)

Temp             Cold  Hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27